export const PRIVACY_POLICY = `
제1조(개인정보의 처리목적)
회사는 다음의 목적을 위하여 개인정보를 처리합니다. 처리하고 있는 개인정보는 다음의 목적 이외의 용도로는 이용되지 않으며, 이용 목적이 변경되는 경우에는 개인정보 보호법 제18조에 따라 별도의 동의를 받는 등 필요한 조치를 이행할 예정입니다.

1. 홈페이지 회원 가입 및 관리
회원 가입의사 확인, 회원제 서비스 제공에 따른 본인 식별·인증, 회원자격 유지·관리, 제한적 본인확인제 시행에 따른 본인확인, 서비스 부정이용 방지, 만 14세 미만 아동의 개인정보 처리시 법정대리인의 동의여부 확인, 각종 고지·통지, 고충처리 등을 목적으로 개인정보를 처리합니다.
2. 재화 또는 서비스 제공
물품배송, 서비스 제공, 계약서·청구서 발송, 콘텐츠 제공, 맞춤서비스 제공, 본인인증, 연령인증, 요금결제·정산, 채권추심 등을 목적으로 개인정보를 처리합니다.
3. 고충처리
민원인의 신원 확인, 민원사항 확인, 사실조사를 위한 연락·통지, 처리결과 통보 등의 목적으로 개인정보를 처리합니다.

제2조(개인정보의 처리 및 보유기간)
① 회사는 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터 개인정보를 수집시에 동의받은 개인정보 보유·이용기간 내에서 개인정보를 처리·보유합니다.
② 각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.
1. 홈페이지 회원 가입 및 관리 : 홈페이지 탈퇴 후 5일까지
다만, 다음의 사유에 해당하는 경우에는 해당 사유 종료시까지
1) 관계 법령 위반에 따른 수사·조사 등이 진행중인 경우에는 해당 수사·조사 종료시까지
2) 홈페이지 이용에 따른 채권·채무관계 잔존시에는 해당 채권·채무관계 정산시까지
2. 재화 또는 서비스 제공 : 재화·서비스 공급완료 및 요금결제·정산 완료시까지
다만, 다음의 사유에 해당하는 경우에는 해당 기간 종료시까지
1) 「전자상거래 등에서의 소비자 보호에 관한 법률」에 따른 표시·광고, 계약내용 및 이행 등 거래에 관한 기록
- 표시·광고에 관한 기록 : 6월
- 계약 또는 청약철회, 대금결제, 재화 등의 공급기록 : 5년
- 소비자 불만 또는 분쟁처리에 관한 기록 : 3년
2)「통신비밀보호법」제41조에 따른 통신사실확인자료 보관
- 가입자 전기통신일시, 개시·종료시간, 상대방 가입자번호, 사용도수, 발신기지국 위치추적자료 : 1년
- 컴퓨터통신, 인터넷 로그기록자료, 접속지 추적자료 : 3개월

제3조(개인정보처리의 위탁)
① 회사는 원활한 개인정보 업무처리를 위하여 다음과 같이 개인정보 처리업무를 위탁하고 있습니다.
1. 시스템 운영
- 위탁받는 자 (수탁자) : 주식회사 팜러닝
- 위탁하는 업무의 내용 : 교육관리시스템(LMS) 관리 및 유지보수
② 회사는 위탁계약 체결시 개인정보 보호법 제25조에 따라 위탁업무 수행목적 외 개인정보 처리금지, 기술적·관리적 보호조치, 재위탁 제한, 수탁자에 대한 관리·감독, 손해배상 등 책임에 관한 사항을 계약서 등 문서에 명시하고, 수탁자가 개인정보를 안전하게 처리하는지를 감독하고 있습니다.
③ 위탁업무의 내용이나 수탁자가 변경될 경우에는 지체없이 본 개인정보 처리방침을 통하여 공개하도록 하겠습니다.

제4조(정보주체의 권리·의무 및 행사방법)
① 정보주체는 회사에 대해 언제든지 다음 각 호의 개인정보 보호 관련 권리를 행사할 수 있습니다.
1. 개인정보 열람요구
2. 오류 등이 있을 경우 정정 요구
3. 삭제요구
4. 처리정지 요구
② 제1항에 따른 권리 행사는 회사에 대해 서면, 전화, 전자우편, 모사전송(FAX) 등을 통하여 하실 수 있으며 회사는 이에 대해 지체없이 조치하겠습니다.
③ 정보주체가 개인정보의 오류 등에 대한 정정 또는 삭제를 요구한 경우에는 회사는 정정 또는 삭제를 완료할 때까지 당해 개인정보를 이용하거나 제공하지 않습니다.
④ 제1항에 따른 권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수 있습니다. 이 경우 개인정보 보호법 시행규칙 별지 제11호 서식에 따른 위임장을 제출하셔야 합니다.
⑤ 정보주체는 개인정보 보호법 등 관계법령을 위반하여 회사가 처리하고 있는 정보주체 본인이나 타인의 개인정보 및 사생활을 침해하여서는 아니됩니다.
⑥ 만 14세 미만 아동의 법정대리인의 법령 상의 권리를 보장합니다. (아동의 개인정보에 대한 열람, 정정, 삭제, 개인정보처리정지요구권)

제5조(처리하는 개인정보 항목)
회사는 다음의 개인정보 항목을 처리하고 있습니다.
1. 홈페이지 회원 가입 및 관리
- 필수항목 : 성명, 아이디, 비밀번호, 이메일, 생년월일, 성별
- 선택항목 : 주소, 전화번호, 아이핀번호
2. 재화 또는 서비스 제공
- 필수항목 : 성명, 생년월일, 아이디, 비밀번호, 주소, 전화번호, 이메일주소, 아이핀번호, 신용카드번호, 은행계좌정보 등 결제정보
- 선택항목 : 관심분야, 과거 구매내역
3. 인터넷 서비스 이용과정에서 아래 개인정보 항목이 자동으로 생성되어 수집될 수 있습니다.
- IP주소, 쿠키, MAC주소, 서비스 이용기록, 방문기록, 불량 이용기록 등

제6조(개인정보의 파기)
① 회사는 개인정보 보유기간의 경과, 처리목적 달성 등 개인정보가 불필요하게 되었을 때에는 지체없이 해당 개인정보를 파기합니다.
② 정보주체로부터 동의받은 개인정보 보유기간이 경과하거나 처리목적이 달성되었음에도 불구하고 다른 법령에 따라 개인정보를 계속 보존하여야 하는 경우에는, 해당 개인정보를 별도의 데이터베이스(DB)로 옮기거나 보관장소를 달리하여 보존합니다.
③ 개인정보 파기의 절차 및 방법은 다음과 같습니다.
1. 파기절차
회사는 파기 사유가 발생한 개인정보를 선정하고, 회사의 개인정보 보호책임자의 승인을 받아 개인정보를 파기합니다.
2. 파기방법
회사는 전자적 파일 형태로 기록·저장된 개인정보는 기록을 재생할 수 없도록 로우레밸포멧(Low Level Format) 등의 방법을 이용하여 파기하며, 종이 문서에 기록·저장된 개인정보는 분쇄기로 분쇄하거나 소각하여 파기합니다.

제7조(개인정보 자동수집장치 이용여부)
쿠키(Cookie)를 설치, 운영하고 있고 이용자는 이를 거부할 수 있습니다.
1. 쿠키란 무엇인가?
쿠키란 웹사이트를 운영하는데 이용되는 서버가 이용자의 브라우저에 보내는 아주 작은 텍스트 파일로서 이용자의 컴퓨터에 저장됩니다.
2. 쿠키를 왜 사용하나?
쿠키를 통해 이용자가 선호하는 설정 등을 저장하여 이용자에게 보다 빠른 웹 환경을 지원하며, 편리한 이용을 위해 서비스 개선에 활용합니다. 이를 통해 이용자는 보다 손쉽게 서비스를 이용할 수 있게 됩니다.
3. 쿠키를 수집하지 못하게 거부하고 싶다면?
이용자는 쿠키 설치에 대한 선택권을 가지고 있습니다. 따라서, 이용자는 웹 브라우저에서 옵션을 설정함으로써 모든 쿠키를 허용하거나, 쿠키가 저장될 때마다 확인을 거치거나, 모든 쿠키의 저장을 거부할 수도 있습니다. 다만 쿠키 설치를 거부할 경우 웹 사용이 불편해지며 로그인이 필요한 일부 서비스 이용에 어려움이 있을 수 있습니다.

제8조(개인정보의 안전성 확보조치)
회사는 개인정보의 안전성 확보를 위해 다음과 같은 조치를 취하고 있습니다.
- 관리적 조치 : 내부관리계획 수립·시행, 정기적 직원 교육 등
- 기술적 조치 : 개인정보처리시스템 등의 접근권한 관리, 접근통제시스템 설치, 고유식별정보 등의 암호화, 보안프로그램 설치
- 물리적 조치 : 전산실, 자료보관실 등의 접근통제

제9조(개인정보 보호책임자)
① 회사는 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.
▶ 개인정보 보호책임자
- 성명 : 최필승
- 직책 : 대표
- 연락처 : 02-782-7829, willwin1@naver.com
※ 개인정보 보호 담당부서로 연결됩니다.
▶ 개인정보 보호 담당부서
- 부서명 : 사업개발부
- 담당자 : 김진만
- 연락처 : 02-782-7834, jmhanmu@gmail.com
② 정보주체께서는 회사의 서비스(또는 사업)을 이용하시면서 발생한 모든 개인정보 보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을 개인정보 보호책임자 및 담당부서로 문의하실 수 있습니다. 회사는 정보주체의 문의에 대해 지체없이 답변 및 처리해드릴 것입니다.

제10조(개인정보 열람청구)
정보주체는 개인정보 보호법 제35조에 따른 개인정보의 열람 청구를 아래의 부서에 할 수 있습니다. 회사는 정보주체의 개인정보 열람청구가 신속하게 처리되도록 노력하겠습니다.
▶ 개인정보 열람청구 접수·처리 부서
- 부서명 : 사업개발부
- 담당자 : 김진만
- 연락처 : 02-782-7834, jmhanmu@gmail.com

제11조(권익침해 구제방법)
정보주체는 아래의 기관에 대해 개인정보 침해에 대한 피해구제, 상담 등을 문의하실 수 있습니다.
아래의 기관은 회사와는 별개의 기관으로서, 회사의 자체적인 개인정보 불만처리, 피해구제 결과에 만족하지 못하시거나 보다 자세한 도움이 필요하시면 문의하여 주시기 바랍니다.
▶ 개인정보 침해신고센터 (한국인터넷진흥원 운영)
- 소관업무 : 개인정보 침해사실 신고, 상담 신청
- 홈페이지 : privacy.kisa.or.kr
- 전화 : (국번없이) 118
- 주소 : (138-950) 서울시 송파구 중대로 135 한국인터넷진흥원 개인정보침해신고센터
▶ 개인정보 분쟁조정위원회 (한국인터넷진흥원 운영)
- 소관업무 : 개인정보 분쟁조정신청, 집단분쟁조정 (민사적 해결)
- 홈페이지 : privacy.kisa.or.kr
- 전화 : (국번없이) 118
- 주소 : (138-950) 서울시 송파구 중대로 135 한국인터넷진흥원 개인정보침해신고센터
▶ 대검찰청 사이버범죄수사단 : 02-3480-3573 (www.spo.go.kr)
▶ 경찰청 사이버테러대응센터 : 1566-0112 (www.netan.go.kr)

제12조 (개인정보의 마케팅 활용)
회사는 회원의 동의를 받아 회원의 개인정보를 활용하여 회사의 상품 및 서비스에 대한 정보를 홍보하기 위해 문자 메시지, 이메일 등을 발송할 수 있습니다.
회원은 언제든지 이러한 정보 제공을 거부할 수 있으며, 정보 제공 거부 시 홍보성 문자 및 이메일 발송이 중단됩니다.
정보 제공 거부는 개인정보 관리 페이지 또는 회사가 제공하는 방법을 통해 설정할 수 있습니다.
회원이 홍보성 정보를 수신 거부하지 않은 경우, 회사는 이를 동의한 것으로 간주하며, 마케팅 목적의 정보 제공에 활용할 수 있습니다.

제13조 (개인정보 처리방침 변경)
① 이 개인정보 처리방침은 2024.10.05 부터 적용됩니다.
`;

export const TERMS_OF_SERVICE = `
제 1 조 (목적)
이 약관은 주식회사 팜러닝(이하 “팜러닝”이라 함)이 제공하는 제반 서비스의 이용에 관한 조건 및 절차에 관한 기본적인 사항과 기타 필요한 사항을 규정함을 목적으로 한다.

제 2 조 (정의)
① 이 약관에서 사용하는 용어의 정의는 다음과 같다.
1.서비스 : 구현되는 단말기(PC, TV, 휴대형단말기 등의 각종 유무선 장치를 포함)와 상관없이 회원이 이용할 수 있는 팜러닝에서 제공하는 관련 제반 서비스를 의미한다.
2.회 원 : 팜러닝의 서비스에 접속하여 이 약관에 따라 팜러닝과 이용계약을 체결하고 팜러닝이 제공하는 서비스를 이용하는 고객을 말한다.
3.아이디(ID) : 회원의 식별과 서비스 이용을 위하여 회원이 정하고 팜러닝이 승인하는 문자와 숫자의 조합을 의미한다.
4.비밀번호 : 회원이 부여 받은 아이디와 일치되는 회원임을 확인하고 비밀보호를 위해 회원 자신이 정한 문자 또는 숫자의 조합을 의미한다.
5.콘텐츠 : 팜러닝이 웹사이트에서 제공하는 온라인 강좌 및 기타 관련 정보를 의미한다.
6.운영자 : 서비스의 전반적인 관리와 원활한 운영을 위하여 팜러닝에서 선정한 사람을 의미한다.
7.해 지 : 팜러닝 또는 회원이 서비스 개통 이후 이용계약을 종료시키는 의사 표시를 의미한다.
② 제1항의 용어를 제외한 용어의 정의는 거래 관행 및 관계 법령에 따른다.

제 3 조 (약관의 게시와 개정)
①팜러닝은 이 약관의 내용을 회원이 쉽게 알 수 있도록 서비스 초기 화면에 게시한다.
②팜러닝은 ‘약관의 규제에 관한 법률’, ‘정보통신망 이용촉진 및 정보보호 등에 관한 법률(이하 “정보통신망법”이라 함)’ 등 관련법을 위배하지 않는 범위에서 이 약관을 개정할 수 있다.
③팜러닝이 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께 제1항의 방식에 따라 그 개정약관의 적용일자 30일 전부터 적용일자 전일까지 공지한다. 단 회원의 권리, 의무에 중대한 영향을 주는 변경이 아닌 경우에는 적용일자 7일 전부터 공지하도록 한다.
④제3항에 따라 시행일 이후에 회원이 서비스를 이용하는 경우에는 개정약관에 동의한 것으로 간주한다. 회원은 변경된 약관에 동의하지 않을 경우 이용계약을 해지할 수 있다.
⑤유료서비스를 이용하는 회원이 이 약관의 개정에 대해 동의하지 않아 이용계약을 해지할 경우에는 유료서비스약관이 정한 환불정책에 따른다.

제 4 조 (약관의 해석)
①팜러닝은 유료서비스 및 개별서비스에 대해서는 별도의 이용약관 및 정책(이하 “유료서비스약관 등”이라 함)을 둘 수 있으며, 해당 내용이 이 약관과 상충할 경우에는 유료서비스약관 등이 우선하여 적용된다.
②이 약관에서 정하지 아니한 사항이나 해석에 대해서는 유료서비스약관 등 및 관계법령 또는 관례에 따른다.

제 5 조 (이용계약 체결)
①이용계약은 회원이 되고자 하는 자(이하 “가입신청자”이라 함)가 약관의 내용에 대하여 동의를 한 다음 회원가입신청을 하고 팜러닝이 이러한 신청에 대하여 승낙함으로써 체결된다.
②팜러닝은 가입신청자의 신청에 대하여 서비스 이용을 승낙함을 원칙으로 한다. 다만, 팜러닝은 다음 각 호에 해당하는 신청에 대하여는 승낙을 하지 않거나 사후에 이용계약을 해지할 수 있다.
1.가입신청자가 이 약관에 의하여 이전에 회원자격을 상실한 적이 있는 경우다만, 회원자격 상실 후 1년이 경과한 자로서 팜러닝의 회원 재가입 승낙을 얻은 경우에는 예외로 함.
2.실명이 아니거나 타인의 명의를 이용한 경우
3.허위의 정보를 기재하거나, 팜러닝이 제시하는 내용을 기재하지 않은 경우
4.14세 미만 아동이 법정대리인(부모 등)의 동의를 얻지 아니한 경우
5.이용자의 귀책사유로 인하여 승인이 불가능하거나 기타 규정한 제반 사항을 위반하며 신청하는 경우
③제1항에 따른 신청에 있어 팜러닝은 회원의 종류에 따라 전문기관을 통한 실명확인 및 본인인증을 요청할 수 있다.
④팜러닝은 서비스 관련 설비의 여유가 없거나, 기술상 또는 업무상 문제가 있는 경우에는 승낙을 유보할 수 있다.
⑤제2항과 제4항에 따라 회원가입 신청의 승낙을 하지 아니하거나 유보한 경우, 팜러닝은 원칙적으로 이를 가입신청자에게 알리도록 한다.
⑥이용계약의 성립 시기는 팜러닝이 신청절차 상 가입완료를 한 시점으로 한다.
⑦팜러닝은 회원에 대해 정책에 따라 등급별로 구분하여 이용시간, 이용횟수, 서비스 메뉴 등을 세분하여 이용에 차등을 둘 수 있다.
⑧팜러닝은 회원에 대하여 ‘영화 및 비디오물의 진흥에 관한 법률’ 및 ‘청소년 보호법’ 등에 따른 등급 및 연령 준수를 위해 이용제한이나 등급별 제한을 할 수 있다.

제 6 조 (회원정보의 변경)
①회원은 개인정보관리화면을 통하여 언제든지 본인의 개인정보를 열람하고 수정할 수 있다. 다만, 서비스 관리를 위해 필요한 실명, 주민등록번호, 아이디 등은 수정이 불가능하다.
②회원은 회원가입신청 시 기재한 사항이 변경되었을 경우 온라인으로 수정을 하거나 전자우편 등 기타 방법으로 팜러닝에 대하여 그 변경사항을 알려야 한다.
③제2항의 변경사항을 팜러닝에 알리지 않아 발생한 불이익에 대하여 팜러닝은 책임지지 않는다.

제 7 조 (개인정보보호 의무)
팜러닝은 정보통신망법 등 관계 법령이 정하는 바에 따라 회원의 개인정보를 보호하기 위해 노력한다. 개인정보의 보호 및 사용에 대해서는 관련법 및 팜러닝의 개인정보취급방침이 적용된다. 다만, 팜러닝의 공식 사이트 이외의 링크된 사이트에서는 팜러닝의 개인정보취급방침이 적용되지 않는다.

제 8 조 ("회원"의 "아이디" 및 "비밀번호"의 관리에 대한 의무)
①회원의 아이디와 비밀번호에 관한 관리책임은 회원에게 있으며, 이를 제3자가 이용하도록 하여서는 안 된다.
②팜러닝은 회원의 아이디가 개인정보 유출 우려가 있거나, 반사회적 또는 미풍양속에 어긋나거나 팜러닝 및 팜러닝의 운영자로 오인할 우려가 있는 경우, 해당 아이디의 이용을 제한할 수 있다.
③회원은 아이디 및 비밀번호가 도용되거나 제3자가 사용하고 있음을 인지한 경우에는 이를 즉시 팜러닝에 통지하고 팜러닝의 안내에 따라야 한다.
④제3항의 경우에 해당 회원이 팜러닝에 그 사실을 통지하지 않거나, 통지한 경우에도 팜러닝의 안내에 따르지 않아 발생한 불이익에 대하여 팜러닝은 책임지지 않는다.

제 9 조 ("회원"에 대한 통지)
①팜러닝이 회원에 대한 통지를 하는 경우 이 약관에 별도 규정이 없는 한 회원이 지정한 전자우편주소, 서비스 내 전자메모 등으로 할 수 있다.
②팜러닝은 회원 전체에 대한 통지의 경우 7일 이상 팜러닝의 게시판에 게시함으로써 제1항의 통지에 갈음할 수 있다.

제 10 조 ("학교"의 의무)
①팜러닝은 관련법과 이 약관이 금지하거나 미풍양속에 반하는 행위를 하지 않으며, 계속적이고 안정적으로 서비스를 제공하기 위하여 최선을 다하여 노력한다.
②팜러닝은 회원이 안전하게 서비스를 이용할 수 있도록 개인정보(신용정보 포함)보호를 위해 보안시스템을 갖추어야 하며 개인정보취급방침을 공시하고 준수한다.
③팜러닝은 회원 개인의 정보를 본인의 승낙 없이 제3자에게 누설, 배포하지 않는 것을 원칙으로 한다. 단, 아래 사항에 해당하는 겨우는 예외로 인정한다.
1.정보통신망법 등 법률의 규정에 의해 국가기관의 요구가 있는 경우
2.범죄에 대해 수사상의 목적이 있거나 정보통신윤리위원회의 요청이 있는 경우
3.기타 관계법령이 정한 절차에 따른 요청이 있는 경우
④팜러닝은 서비스 이용과 관련하여 회원으로부터 제기된 의견이나 불만이 정당하다고 인정할 경우에는 이를 처리하여야 한다. 회원이 제기한 의견이나 불만사항에 대해서는 게시판을 활용하거나 전자우편 등을 통하여 회원에게 처리과정 및 결과를 전달한다.

제 11 조 ("회원"의 의무)
①회원은 서비스를 이용할 때 다음의 행위를 하여서는 안 된다.
1.신청 또는 변경 시 허위내용의 등록
2.타인의 정보도용
3.팜러닝이 게시한 정보의 변경
4.팜러닝과 기타 제3자의 저작권 등 지적재산권에 대한 침해
5.팜러닝 및 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위
6.외설 또는 폭력적인 메시지, 화상, 음성, 기타 공서양속에 반하는 정보를 서비스에 공개 또는 게시하는 행위
7.팜러닝의 동의 없이 영리를 목적으로 서비스를 사용하는 행위
8.서비스의 이용권한, 기타 이용 계약상 지위 및 권리를 타인에게 양도, 증여하는 행위
9.다른 회원의 개인정보를 수집, 저장, 공개하는 행위
10.법령에 의하여 그 전송 또는 게시가 금지되는 정보(컴퓨터 프로그램 포함)의 전송 또는 게시하는 행위
11.팜러닝의 직원이나 운영자를 사칭하거나 타인의 명의를 도용하여 글을 게시 하거나 메일을 발송하는 행위
12.컴퓨터 소프트웨어, 하드웨어, 전기통신 장비의 정상적인 가동을 방해, 파괴할 목적으로 고안된 소프트웨어 바이러스 및 기타 다른 컴퓨터 코드, 파일, 프로그램을 포함하고 있는 자료를 게시하거나 전송하는 행위
13.기타 불법적이거나 부당한 행위
②회원은 관계법, 이 약관의 규정, 이용안내 및 서비스와 관련하여 공지한 주의사항, 팜러닝이 통지하는 사항 등을 준수하여야 하며, 기타 팜러닝의 업무에 방해되는 행위를 하여서는 안 된다.

제 12 조 ("서비스"의 제공 등)
①팜러닝은 회원에게 아래와 같은 서비스를 제공한다.
1.온라인 교육 콘텐츠
2.기타 팜러닝이 추가 개발하거나 다른 학교와의 제휴계약 등을 통해 회원에게 제공하는 일체의 서비스
②팜러닝은 서비스를 일정범위로 분할하여 각 범위 별로 이용가능시간을 별도로 지정할 수 있다. 다만, 이러한 경우에는 그 내용을 사전에 공지한다.
③서비스는 연중무휴, 1일 24시간 제공함을 원칙으로 한다.
④팜러닝은 컴퓨터 등 정보통신설비의 보수점검, 교체 및 고장, 통신두절 또는 운영상 상당한 이유가 있는 경우 서비스의 제공을 일시적으로 중단할 수 있다. 이 경우 팜러닝은 제9조(회원에 대한 통지)에 정한 방법으로 회원에게 통지한다. 다만, 팜러닝이 사전에 통지할 수 없는 부득이한 사유가 있는 경우 사후에 통지할 수 있다.
⑤팜러닝은 서비스의 제공에 필요한 경우 정기점검을 실시할 수 있으며, 정기점검시간은 서비스 제공화면에 공지한 바에 따른다.

제 13 조 ("서비스"의 변경)
①팜러닝은 운영상, 기술상의 필요에 따라 제공하고 있는 전부 또는 일부 서비스를 변경할 수 있다.
②서비스의 내용, 이용방법, 이용시간에 대하여 변경이 있는 경우에는 변경사유, 변경될 서비스의 내용 및 제공일자 등은 그 변경 전 7일 이상 해당 서비스 초기화면에 게시하여야 한다.
③팜러닝은 무료로 제공되는 서비스의 일부 또는 전부를 학교의 정책 및 운영의 필요상 수정, 중단, 변경할 수 있으며, 이에 대하여 관련법에 특별한 규정이 없는 한 회원에게 별도의 보상을 하지 않는다.

제 14 조 (정보의 제공 및 광고의 게재)
①팜러닝은 회원이 서비스 이용 중 필요하다고 인정되는 다양한 정보를 공지사항이나 전자우편 등의 방법으로 회원에게 제공할 수 있다. 다만, 회원은 관련법에 따른 거래관련 정보 및 고객문의 등에 대한 답변 등을 제외하고는 언제든지 전자우편 등에 대해서 수신 거절을 할 수 있다.
②제1항의 정보를 전화 및 모사전송기기에 의하여 전송하려고 하는 경우에는 회원의 사전 동의를 받아서 전송한다. 다만, 회원의 거래관련 정보 및 고객문의 등에 대한 회신에 있어서는 제외된다.
③팜러닝은 서비스의 운영과 관련하여 서비스화면, 홈페이지, 전자우편 등에 광고를 게재할 수 있다. 광고가 게재된 전자우편 등을 수신한 회원은 수신거절을 팜러닝에게 할 수 있다.

제 15 조 (수강 승인)
①팜러닝은 규정한 결제방법을 사용하여 이용요금을 납입한 사실이 확인되면 지체없이 수강신청을 승인한다.
②팜러닝은 아래에 해당하는 경우 수강 신청에 대한 승인을 제한할 수 있고, 그 사유가 해소될 때까지 승인을 유보할 수 있다.
1.이용요금을 납입하지 않은 경우
2.이용요금 입금 금액 총액이 신청 금액 총애게 미달되는 경우
3.기타 팜러닝이 필요하다고 인정되는 경우
③제2항에 의하여 수강 신청의 승인을 유보하거나 승인하지 아니하는 경우, 교육원은 이를 수강 신청자에게 알려야 한다.

제 16 조 (수강 취소 및 환불)
①학습비 반환사유가 발생한 경우, ‘평생교육법 시행령 23조 학습비의 반환 등’에 따라 환불 받을 수 있고 수강을 철회할 수 있다.
②이벤트성 강좌(쿠폰 등 포함), 비정규 강좌, 특별기획 강좌 등에서는 별도의 수강 취소/변경 및 환불규정이 적용 될 수 있다.

제 17 조 (게시물의 저작권)
①서비스에 대한 저작권 및 지적재산권은 팜러닝에 귀속된다. 단, 회원의 게시물 및 제휴계약에 따라 제공된 저작물 등은 제외한다.
②회원이 서비스 내에 게시한 게시물의 저작권은 해당 게시물의 저작자에게 귀속된다.
③회원이 서비스 내에 게시하는 게시물은 검색결과 내지 서비스 프로모션 등에 노출될 수 있으며, 해당 노출을 위해 필요한 범위 내에서는 일부 수정, 편집되어 게시될 수 있다. 이 경우, 회원은 언제든지 고객센터를 통해 해당 게시물에 대해 삭제, 검색결과 제외, 비공개 등의 조치를 취할 수 있다.
④팜러닝은 제3항 이외의 방법으로 회원의 게시물을 이용하고자 하는 경우에는 전화, 팩스, 전자우편 등을 통해 사전에 회원의 동의를 얻어야 한다.

제 18 조 (게시물의 관리)
①회원의 게시물이 정보통신망법 및 저작권법등 관련법에 위반되는 내용을 포함하는 경우, 권리자는 관련법이 정한 절차에 따라 해당 게시물의 게시중단 및 삭제 등을 요청할 수 있으며, 팜러닝은 관련법에 따라 조치를 취하여야 한다.
②팜러닝은 전항에 따른 권리자의 요청이 없는 경우라도 권리침해가 인정될 만한 사유가 있거나 기타 학교 정책 및 관련법에 위반되는 경우에는 관련법에 따라 해당 게시물에 대해 임시조치 등을 취할 수 있다.
③팜러닝은 회원이 게재 또는 등록한 내용물이 다음 각 호에 해당된다고 판단되는 경우에 회원의 동의 없이 그 내용을 삭제할 수 있다.
1.다른 회원 또는 제 3자를 비방하거나 중상모략 함으로써 타인의 명예를 훼손시킨 경우
2.공공질서 및 미풍양속에 위반되는 경우
3.범죄적 행위에 결부된다고 인정되는 경우
4.제 3자의 저작 등 기타 권리를 침해하는 경우
5.기타 관계 법령이나 팜러닝이 정한 구정에 위배되는 경우

제 19 조 (계약 해지)
①회원은 언제든지 서비스 초기화면의 고객센터 또는 내 정보 관리 메뉴 등을 통하여 이용계약 해지 신청을 할 수 있으며, 팜러닝은 관련법 등이 정하는 바에 따라 이를 즉시 처리하여야 한다.
②회원이 계약을 해지할 경우, 관련법 및 개인정보취급방침에 따라 아래와 같이 팜러닝이 관계법령규정 또는 교육이력 유지를 위한 최소한의 개안정보(이름, 주민등록번호 등) 등 보존할 필요가 있는 경우를 제외하고는 해지 즉시 회원의 모든 데이터는 소멸된다.
1.학위 취득에 관한 기록
-보존근거 : 학점인정 등에 관한 법률, 학점은행제 운영규정
-보존기간 : 2년
2.평가 근거에 관한 기록
-보존근거 : 원격교육에 대한 학점인정 기준
-보존기간 : 4년
3.연수에 관한 기록
-보존근거 : 사무관리 규정 제 7조, 공문서분류 및 보존에 관한 규칙 제4조 및 제 5조
-보존기간 : 영구보존
4.사용료 결제 및 콘텐츠 서비스 등의 공급에 관한 기록
-보존근거 : 전자상거래 등에서의 소비자보호에 관한 법률
-보존기간 : 5년
5.계약 또는 청약철회에 관한 기록
-보존근거 : 전자상거래 등에서의 소비자보호에 관한 법률
-보존기간 : 5년
6.소비자의 불만 또는 분쟁처리에 관한 기록
-보존근거 : 전자상거래 등에서의 소비자보호에 관한 법률
-보존기간 : 3년
7.신용정보의 수집, 처리 및 이용 등에 관한 기록
-보존근거 : 신용정보의 이용 및 보호에 관한 법률
-보존기간 : 3년
8.방문에 관한 기록
-보존근거 : 통신비밀보호법
-보존기간 : 3개월
③회원이 계약을 해지하는 경우, 회원이 작성한 게시물 중 메일, 블로그 등과 같이 본인 계정에 등록된 게시물 일체는 삭제된다. 다만, 타인에 의해 담기, 스크랩 등이 되어 재게시되거나, 공용게시판에 등록된 게시물 등은 삭제되지 않으니 사전에 삭제 후 탈퇴하여야 한다.

제 20 조 (이용제한)
①팜러닝은 회원이 이 약관의 의무를 위반하거나 서비스의 정상적인 운영을 방해한 경우, 경고, 일시정지, 영구이용정지 등으로 서비스 이용을 단계적으로 제한할 수 있다.
②팜러닝은 전항에도 불구하고, 주민등록법을 위반한 명의도용 및 결제도용, 저작권법 및 컴퓨터프로그램보호법을 위반한 불법프로그램의 제공 및 운영방해, 정보통신망법을 위반한 불법통신 및 해킹, 악성프로그램의 배포, 접속권한 초과행위 등과 같이 관련법을 위반한 경우에는 즉시 영구이용정지를 할 수 있다. 본 항에 따른 영구이용정지 시 서비스 이용을 통해 획득한 쿠폰 및 기타 혜택 등도 모두 소멸되며, 팜러닝은 이에 대해 별도로 보상하지 않는다.
③팜러닝은 회원이 계속해서 6개월 이상 로그인하지 않는 경우, 회원정보의 보호 및 운영의 효율성을 위해 이용을 제한할 수 있다.
④팜러닝은 본 조의 이용제한 범위 내에서 제한의 조건 및 세부내용은 이용제한정책 및 개별 서비스상의 운영정책에서 정하는 바에 의한다.
⑤본 조에 따라 서비스 이용을 제한하거나 계약을 해지하는 경우에는 팜러닝은 제9조[회원에 대한 통지]에 따라 통지한다.
⑥회원은 본 조에 따른 이용제한 등에 대해 팜러닝이 정한 절차에 따라 이의신청을 할 수 있다. 이 때 이의가 정당하다고 팜러닝이 인 정하는 경우 팜러닝은 즉시 서비스의 이용을 재개한다.

제 21 조 (책임제한)
①팜러닝은 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에 관한 책임이 면제된다.
②팜러닝은 회원의 귀책사유로 인한 서비스 이용의 장애에 대하여는 책임을 지지 않는다.
③팜러닝은 회원이 서비스와 관련하여 게재한 정보, 자료, 사실의 신뢰도, 정확성 등의 내용에 관하여는 책임을 지지 않는다.
④팜러닝은 회원 간 또는 회원과 제3자 상호간에 서비스를 매개로 하여 거래 등을 한 경우에는 책임이 면제된다.
⑤팜러닝은 무료로 제공되는 서비스 이용과 관련하여 관련법에 특별한 규정이 없는 한 책임을 지지 않는다.

제 22 조 (준거법 및 재판관할)
①팜러닝과 회원 간 제기된 소송은 대한민국법을 준거법으로 한다.
②팜러닝과 회원 간 발생한 분쟁에 관한 소송은 민사소송법 상의 관할법원에 제소한다.

제 23 조 (규정의 준용)
이용약관에 명시되지 않은 사항에 대해서는 전자상거래 등에서의 소비자 보호에 관한 법률 등 관계 법령에 의하며, 법에 명시 되지 않은 사안에 대해서는 관례에 따른다.

제24조 (홍보성 정보의 발송)
회사는 회원에게 서비스 이용과 관련된 정보를 전자우편, 문자 메시지, 푸시 알림 등의 방법으로 발송할 수 있습니다. 이에는 회사의 상품 및 서비스에 대한 홍보성 정보도 포함될 수 있습니다.
회원이 홍보성 정보 수신에 동의한 경우, 회사는 회원이 제공한 연락처를 활용하여 정보를 발송할 수 있습니다.
회원은 언제든지 홍보성 정보 수신을 거부할 수 있으며, 수신 거부 시 이후부터는 홍보성 정보가 발송되지 않습니다.
홍보성 정보 수신 거부는 서비스 내 설정 페이지 또는 회사가 제공하는 방법을 통해 처리할 수 있습니다.

부칙
①이 약관은 2024.10.05일부터 적용된다.
`;

export const EMAIL_REFUSAL = `
#이메일무단수집거부
본 웹사이트에 게시된 이메일 주소가 전자우편 수집 프로그램이나 그 밖의 기술적 장치를 이용하여 무단으로 수집되는 것을 거부하며, 이를 위반시 정보통신망법에 의해 형사처벌됨을 유념하시기 바랍니다.

전자우편주소의 무단 수집행위 등 금지
누구든지 전자우편주소의 수집을 거부하는 의사가 명시된 인터넷 홈페이지에서 자동으로 전자우편주소를 수집하는 프로그램 그 밖의 기술적 장치를 이용하여 전자우편주소를 수집하여서는 아니된다.

누구든지 제1항의 규정을 위반하여 수집된 전자우편주소를 판매·유통하여서는 아니된다.

누구든지 제1항 및 제2항의 규정에 의하여 수집·판매 및 유통이 금지된 전자우편주소임을 알고 이를 정보전송에 이용하여서는 아니된다.
`;

export const CONSENT_FORM_TEXT = `농업 · 농촌교육 참여자 개인정보 수집 · 이용 · 제3자 제공에 관한 동의서
농림수산식품교육문화정보원(이하 '농정원')에서는 농업 · 농촌교육 운영 및 농업교육포털을 통한 교육이력 관리를 위하여 아래와 같이 개인정보를 수집 · 이용 및 제 3자에게 제공하고자 합니다. 내용을 자세히 읽으신 후 동의 여부를 결정하여 주시기 바랍니다.

[개인정보 수집 · 이용에 관한 사항(필수)]
개인정보의 수집 · 이용 목적 : 농업교육포털(agriedu.net)의 교육이수실적 증빙, 개인별 교육이력 관리, 교육생 통계, 정부 · 지방자치단체 · 농정원 등 공공기관의 운영에 관한 법률 제 2조에 해당하는 공공기관 · 해당 농업교육기관 등 정보제공 및 정책자료 활용 (사업관련 각종 연구 · 설문조사 포함)

수집 · 이용할 개인정보 항목(필수) : 성명, 생년월일, 성별, 전화번호, 주민등록상 주소, E-mail, 교육 참여동기, 주 작물

보유 및 이용기간 : 준영구

※ 위의 개인정보 수집 · 이용에 대한 동의를 거부할 수 있습니다. 다만, 이에 대한 동의를 하지 않을 경우에는 불이익(교육 참여 제한 또는 교육이수실적 증빙 불가 등)이 있을 수 있습니다. (만 14세 미만인 경우에는 법정대리인이 동의)`;
